In [1]:
import pandas as pd
import numpy as np
import sqlalchemy
import pandasql as ps

In [2]:
df=pd.read_csv('titanic.csv')

In [14]:
ps.sqldf("""

SELECT *
FROM df;

""")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,None,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,None,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,None,Q

In [15]:
ps.sqldf("""
SELECT 
df.Embarked,
AVG(df.Age),
SUM(df.Age),
Count(df.PassengerId),
Count(DISTINCT df.Ticket)
FROM df
GROUP BY df.Embarked;
""")

,Embarked,AVG(df.Age),SUM(df.Age),Count(df.PassengerId),Count(DISTINCT df.Ticket)
0,None,50.000000,100.00,2,1
1,C,30.814769,4005.92,168,122
2,Q,28.089286,786.50,77,66
3,S,29.445397,16312.75,644,494

In [16]:
ps.sqldf("""
SELECT 
df.Embarked,
AVG(df.Age),
SUM(df.Age),
MAX(df.Age),
MIN(df.Age),
Count(df.PassengerId),
Count(DISTINCT df.Ticket)
FROM df
GROUP BY df.Embarked;
""")

,Embarked,AVG(df.Age),SUM(df.Age),MAX(df.Age),MIN(df.Age),Count(df.PassengerId),Count(DISTINCT df.Ticket)
0,None,50.000000,100.00,62.0,38.00,2,1
1,C,30.814769,4005.92,71.0,0.42,168,122
2,Q,28.089286,786.50,70.5,2.00,77,66
3,S,29.445397,16312.75,80.0,0.67,644,494

In [17]:
ps.sqldf("""
SELECT 
df.Embarked,
df.Sex,
AVG(df.Age),
SUM(df.Age),
MAX(df.Age),
MIN(df.Age),
Count(df.PassengerId),
Count(DISTINCT df.Ticket)
FROM df
GROUP BY df.Embarked,
df.Sex;
""")

,Embarked,Sex,AVG(df.Age),SUM(df.Age),MAX(df.Age),MIN(df.Age),Count(df.PassengerId),Count(DISTINCT df.Ticket)
0,None,female,50.000000,100.00,62.0,38.00,2,1
1,C,female,28.344262,1729.00,60.0,0.75,73,54
2,C,male,32.998841,2276.92,71.0,0.42,95,88
3,Q,female,24.291667,291.50,39.0,15.00,36,35
4,Q,male,30.937500,495.00,70.5,2.00,41,37
5,S,female,27.771505,5165.50,63.0,1.00,203,158
6,S,male,30.291440,11147.25,80.0,0.67,441,394

In [18]:
ps.sqldf("""
SELECT 
df.Embarked,
df.Sex,
AVG(df.Age),
SUM(df.Age),
MAX(df.Age),
MIN(df.Age),
Count(df.PassengerId),
Count(DISTINCT df.Ticket)
FROM df

WHERE Age>=18 
AND Age<=60

GROUP BY df.Embarked,
df.Sex;
""")

,Embarked,Sex,AVG(df.Age),SUM(df.Age),MAX(df.Age),MIN(df.Age),Count(df.PassengerId),Count(DISTINCT df.Ticket)
0,None,female,38.000000,38.0,38.0,38.0,1,1
1,C,female,35.295455,1553.0,60.0,18.0,44,35
2,C,male,33.838983,1996.5,60.0,18.0,59,56
3,Q,female,27.166667,244.5,39.0,18.0,9,9
4,Q,male,33.850000,338.5,57.0,19.0,10,10
5,S,female,31.909396,4754.5,58.0,18.0,149,136
6,S,male,31.941368,9806.0,60.0,18.0,307,292

In [19]:
ps.sqldf("""
SELECT 
df.Embarked,
df.Sex,
AVG(df.Age),
SUM(df.Age),
MAX(df.Age),
MIN(df.Age),
Count(df.PassengerId),
Count(DISTINCT df.Ticket)
FROM df

WHERE Age>=18 
AND Age<=60

GROUP BY df.Embarked,
df.Sex

ORDER BY df.Sex;
""")

,Embarked,Sex,AVG(df.Age),SUM(df.Age),MAX(df.Age),MIN(df.Age),Count(df.PassengerId),Count(DISTINCT df.Ticket)
0,None,female,38.000000,38.0,38.0,38.0,1,1
1,C,female,35.295455,1553.0,60.0,18.0,44,35
2,Q,female,27.166667,244.5,39.0,18.0,9,9
3,S,female,31.909396,4754.5,58.0,18.0,149,136
4,C,male,33.838983,1996.5,60.0,18.0,59,56
5,Q,male,33.850000,338.5,57.0,19.0,10,10
6,S,male,31.941368,9806.0,60.0,18.0,307,292

In [20]:
 ps.sqldf("""
SELECT 
df.Embarked,
df.Sex,
AVG(df.Age),
SUM(df.Age),
MAX(df.Age),
MIN(df.Age),
Count(df.PassengerId),
Count(DISTINCT df.Ticket)
FROM df

WHERE Age>=18 
AND Age<=60

GROUP BY df.Embarked,
df.Sex

ORDER BY df.Sex AND df.Embarked;
""")

,Embarked,Sex,AVG(df.Age),SUM(df.Age),MAX(df.Age),MIN(df.Age),Count(df.PassengerId),Count(DISTINCT df.Ticket)
0,None,female,38.000000,38.0,38.0,38.0,1,1
1,C,female,35.295455,1553.0,60.0,18.0,44,35
2,C,male,33.838983,1996.5,60.0,18.0,59,56
3,Q,female,27.166667,244.5,39.0,18.0,9,9
4,Q,male,33.850000,338.5,57.0,19.0,10,10
5,S,female,31.909396,4754.5,58.0,18.0,149,136
6,S,male,31.941368,9806.0,60.0,18.0,307,292

In [21]:
 ps.sqldf("""
SELECT 
df.Embarked,
df.Sex,
AVG(df.Age),
SUM(df.Age),
MAX(df.Age),
MIN(df.Age),
Count(df.PassengerId),
Count(DISTINCT df.Ticket)
FROM df

WHERE Age>=18 
AND Age<=60

GROUP BY df.Embarked,
df.Sex

ORDER BY df.Sex AND df.Embarked;
""")

,Embarked,Sex,AVG(df.Age),SUM(df.Age),MAX(df.Age),MIN(df.Age),Count(df.PassengerId),Count(DISTINCT df.Ticket)
0,None,female,38.000000,38.0,38.0,38.0,1,1
1,C,female,35.295455,1553.0,60.0,18.0,44,35
2,C,male,33.838983,1996.5,60.0,18.0,59,56
3,Q,female,27.166667,244.5,39.0,18.0,9,9
4,Q,male,33.850000,338.5,57.0,19.0,10,10
5,S,female,31.909396,4754.5,58.0,18.0,149,136
6,S,male,31.941368,9806.0,60.0,18.0,307,292

In [22]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q